import React from 'react';

const TermsOfService: React.FC = () => (
    <div className="TermsPage w-[1000px] mx-auto my-10">
        <div className="TermsSection">
            <h1 className="TermsTitle">{'<利用規約>'}</h1>
            <p className="TermsContent">
                以下は、Widus Royal Casino（ウィダスロイヤルカジノ）
                とお客様との間で法的拘束力を有する同意書です。よくお読みになり、すべての内容をよく理解してください。本利用規約に同意することで発生する権利や責任、義務について疑問を持つ場合は、お客様の管轄区域にある弁護士や法律顧問などの専門家に相談してください。
            </p>
        </div>
        <div className="terms-content">
            <div className="terms-content__container">
                <p>
                    <strong>第1条定義</strong>
                </p>
                <p>
                    本利用規約に記載される各用語は、特別な注記がない限り、以下の通りに定義されます。
                </p>
            </div>

            <div className="terms-content__container">
                <p>
                    <strong>【オンラインカジノ】</strong>Widus Royal
                    Casino（ウィダスロイヤルカジノ）で提供されるインターネットゲームシステム、関連サービス、およびwidusroyal.comで提供される全ゲーム。
                </p>
                <p>
                    <strong>【当社】</strong>Widus Royal Casino
                    (ウィダスロイヤルカジノ）
                </p>
                <p>
                    <strong>【ウェブサイト】</strong>
                    widusroyal.com、及び当社がサービスを提供する上でアクセス可能なリンクや関連サイト。
                </p>
                <p>
                    <strong>【お客様】</strong>
                    当ウェブサイトのサービスを利用するすべての当事者。
                </p>
                <p>
                    <strong>【サービス】</strong>
                    当社からウェブサイトまたはソフトウェアを通じて提供されるすべてのサービス。
                </p>
                <p>
                    <strong>【プレイヤー口座】</strong>
                    オンラインカジノで個人がゲームをプレイできるように開設・維持される個人名義の口座。
                </p>
                <p>
                    <strong>【ベット】</strong>
                    当サービスおよびウェブサイトを介して行われたベット、賭け、または投資。
                </p>
                <p>
                    <strong>【ユーザーネームとパスワード】</strong>
                    当オンラインカジノへの登録時にお客様が設定されたユーザーネームおよびパスワード。
                </p>
                <p>
                    <strong>【ソフトウェア】</strong>
                    当オンラインカジノ利用のためにウェブサイトからダウンロード、アクセス、利用が必要なすべてのプログラム、データ、ファイル、またはそのコンテンツを含む、当社にライセンス認可されたソフトウェア。
                </p>
                <p>
                    <strong>【禁止区域】</strong>
                    アメリカ合衆国及びその領土、マカオ、
                    スイス、アイルランド、シンガポール、ハンガリー、
                    ミャンマー、ルーマニア、ベルギー、デンマーク、フィンランド、
                    ドイツ、イラン、イラク、イタリア、ミクロネシア、
                    ノルウェイ、ポーランド、サウジアラビア、オランダ、
                    プエルトリコ、イギリス、フランス、香港、台湾、北朝鮮、
                    イスラエル、キプロス、エストニア、フィリピン、トルコ、
                    スペイン、ブルガリア、アンティグア・バーブーダ、キュラソーおよび法律でオンラインカジノが禁止されているその他の国や領域。WIDUS
                    ROYAL CASINOを利用することはできません。
                </p>
            </div>

            <div className="terms-content__container">
                <p>
                    <strong>【オンラインカジノ】</strong>Widus Royal
                    Casino（ウィダスロイヤルカジノ）で提供されるインターネットゲームシステム、関連サービス、およびwidusroyal.comで提供される全ゲーム。
                </p>
                <p>
                    <strong>【当社】</strong>Widus Royal Casino
                    (ウィダスロイヤルカジノ）
                </p>
                <p>
                    <strong>【ウェブサイト】</strong>
                    widusroyal.com、及び当社がサービスを提供する上でアクセス可能なリンクや関連サイト。
                </p>
                <p>
                    <strong>【お客様】</strong>
                    当ウェブサイトのサービスを利用するすべての当事者。
                </p>
                <p>
                    <strong>【サービス】</strong>
                    当社からウェブサイトまたはソフトウェアを通じて提供されるすべてのサービス。
                </p>
                <p>
                    <strong>【プレイヤー口座】</strong>
                    オンラインカジノで個人がゲームをプレイできるように開設・維持される個人名義の口座。
                </p>
                <p>
                    <strong>【ベット】</strong>
                    当サービスおよびウェブサイトを介して行われたベット、賭け、または投資。
                </p>
                <p>
                    <strong>【ユーザーネームとパスワード】</strong>
                    当オンラインカジノへの登録時にお客様が設定されたユーザーネームおよびパスワード。
                </p>
                <p>
                    <strong>【ソフトウェア】</strong>
                    当オンラインカジノ利用のためにウェブサイトからダウンロード、アクセス、利用が必要なすべてのプログラム、データ、ファイル、またはそのコンテンツを含む、当社にライセンス認可されたソフトウェア。
                </p>
                <p>
                    <strong>【禁止区域】</strong>
                    アメリカ合衆国及びその領土、マカオ、スイス、アイルランド、
                    シンガポール、ハンガリー、ミャンマー、ルーマニア、ベルギー、
                    デンマーク、フィンランド、ドイツ、イラン、イラク、イタリア、
                    ミクロネシア、ノルウェイ、ポーランド、サウジアラビア、オランダ、
                    プエルトリコ、イギリス、フランス、香港、台湾、北朝鮮、イスラエル、
                    キプロス、エストニア、フィリピン、トルコ、スペイン、ブルガリア、
                    アンティグア・バーブーダ、キュラソーおよび法律でオンラインカジノが禁止されているその他の国や領域。WIDUS
                    ROYAL CASINOを利用することはできません。
                </p>
            </div>
            <div className="terms-content__container">
                <p>
                    <strong>第2条 当社について</strong>
                </p>
                <p>
                    2.1{' '}
                    <span className="text-gold">
                        当社はカナダ法に準拠し、KAHNAWAKE GAMING COMMISSION
                    </span>
                    から完全なライセンス認可および規制を受けています。当社はwidusroyal.comウェブサイトを運営し、インターネット上のオンラインカジノサービスを提供しています。
                </p>
                <p>
                    2.2
                    本利用規約と関連規約に矛盾が生じる場合、本利用規約が優先されます。
                </p>
                <p>
                    2.3
                    当社のウェブサイトやサービスに関するご質問、サービスへのご不満や異議がある場合は、当社のカスタマーサポートにEメール（support@widusroyal.com）でお問い合わせください。
                </p>
            </div>

            <div className="terms-content__container">
                <p>
                    <strong>第3条 本利用規約の適用性</strong>
                </p>
                <p>
                    3.1 本利用規約は、お客様と当社間で同意されたものとします。
                </p>
                <p>
                    3.2
                    本利用規約は、お客様が当サービスを利用した時点でサービスの種類を問わず、お客様と当社の間で交わされる規約となります。
                </p>
                <p>
                    3.3
                    本利用規約は、当社でアカウントを登録した時点から有効となり、有効なアカウントが存在する限り無期限に有効となります。お客様が本利用規約が有効であることを認めた場合、お客様は本利用規約による法的拘束力を受けることに同意したものとみなされます。
                </p>
                <p>
                    3.4
                    本利用規約の変更がある場合、当社はお客様に合理的な手段で通知します。
                    なお、当社はいつでもお客様への通知なしに本利用規約および当社とお客様の間の同意を変更・
                    終了する権利を有します。当社が関連する事項を変更し、お客様が本サービスの利用を継続する場合、その変更に対して全ての内容に同意したものとみなされ、変更された内容は即時に効力を発揮します。
                </p>
            </div>

            <div className="terms-content__container">
                <p>
                    <strong>第4条 登録について</strong>
                </p>
                <p>
                    4.1
                    当社はお客様に対し通知を行うことで、本利用規約およびお客様のオンラインカジノやウェブサイトへのアクセスをいつでも終了できるものとし、通知は当社が提示しない限り即時に効力を発揮します。
                </p>
                <p>
                    4.2
                    お客様は本利用規約に同意しない限り、当社サービスを利用できません。
                </p>
                <p>
                    4.3
                    お客様が本利用規約に一部同意できない場合は、直ちに当サービスの使用を中止してください。
                </p>
            </div>

            <div className="terms-content__container">
                <p>
                    <strong>
                        第5条 ソフトウェアおよびオンラインカジノの利用について{' '}
                    </strong>
                </p>
                <p />
                本第5条は、本利用規約から生じる当社の責任と、法律で許可されている場合のお客様のオンラインカジノ利用について述べています。
                <p />
                <p>
                    5.1
                    当社は当社が提供するサービスやソフトウェアの品質およびその他全てに対してお客様が要求する品質を保証しません。当社は、本利用規約においてすべての暗示的な規約、約束および保証（特定の目的に対する適合性、市場性、適合性を含む）を排除します。
                </p>
                <p>
                    5.2
                    当社は、ソフトウェアのバージョンアップグレードを定期的に開発・提供し、お客様にアップグレードバージョンを利用可能にします。このアップグレードされたソフトウェアは、本利用規約で認証されたものとみなされます。
                </p>
                <p>
                    5.3
                    当社に対する申し立ては、その原因となる出来事から60日以内に行われるもののみが認められます。60日以内に申し立てが行われなかった場合、お客様はその権利を放棄したこととなります。
                </p>
                <p>
                    5.4
                    お客様がゲーム・ソフトウェア・決済サービスに関する第三者組織の製品・
                    ソフトウェア・サービス（第三者組織の製品およびサービス）を利用する場合、
                    それら第三者組織の製品およびサービスの品質や性能に関するすべてのリスクは、
                    お客様自身に委ねられます。それら第三者組織製品およびサービスに欠陥があると証明される場合、
                    その修復や修正に伴う費用はお客様の責任となります。
                </p>
                <p>
                    5.5
                    お客様がソフトウェアをダウンロード・インストール・使用することは、当社の管理外であり、全ての責任はお客様自身にあることとなります。お客様が使用したソフトウェアによって発生したいかなる損害・損失・料金の請求も、当社は一切の責任を負いません。
                </p>
                <p>
                    5.6
                    お客様は、以下に該当する行為やソフトウェアを投稿・送信・利用しないことに同意します。
                </p>
                <ul className="list-unstyled">
                    <li>(1) 第三者の権利を侵害・妨害する行為</li>
                    <li>
                        (2) ウィルス・破損データ・その他有害な破壊的ファイル
                    </li>
                    <li>(3) 不正行為を促す要素</li>
                    <li>
                        (4)
                        第三者のハードウェア・ソフトウェア・その他の機器に損害を与える可能性のあるもの
                    </li>
                </ul>
                <p>
                    5.7
                    当社および関係者は、すべての間接的損害・損失に対して、いかなる責任も負わないこととします。お客様は、ソフトウェアのダウンロード後にゲームを開始した時点でこれを認めるものとします。
                </p>
            </div>

            <div className="terms-content__container">
                <p>
                    <strong>第6条 お客様の責任</strong>
                </p>
                <p>
                    6.1
                    お客様は、当社の書面による事前の合意がない場合、本利用規約に基づく権利を譲渡できないこととします。
                </p>
                <p>
                    6.2
                    お客様は、当社のサービスによって生じた賞金が課税対象であるか、その他の徴税があるかどうかを関連する政府・税務当局・その他の機関に報告し、それによって生じるすべての税金・手数料・その他のコストを支払う責任があります。
                </p>
                <p>
                    6.3
                    お客様が当社に提供した情報に変更がある場合、お客様は直ちに当社にその旨を報告する責任があります。
                </p>
                <p>
                    6.4
                    お客様は、当社のサービスで行ったすべてのベットに関連するルールおよびゲームのルールを理解する責任があります。
                </p>
                <p>
                    6.5
                    オンラインカジノおよびネットワーク接続サービスその他すべての同意および許可は、お客様の単独責任となります。
                </p>
                <p>
                    6.6 お客様は、当社のサービスで使用する乱数生成機能（random
                    number generator:
                    RNG）がサービスを通じてゲームの結果を無作為に生成していることを認識し、それを利用することで得られる結果を受け入れるものとします。
                </p>
            </div>

            <div className="terms-content__container">
                <p>
                    <strong>第7条 プレイヤー口座の開設</strong>
                </p>
                <p>
                    7.1
                    お客様は、当社と提携する支払い処理機関がすべての口座取引を担当することに同意します。
                    お客様が詐欺行為等の不正行為の疑いがある場合、支払い処理機関はすべての支払いを保留する権利を有しています。
                    また、お客様は、当社または当社に関連する第三者に対して支払い責任が発生した場合、すべての支払いを行うことに同意します。
                    さらに、お客様が支払い義務のある資金の棄権もしくは取り消しを行わない場合、お客様は当社に対して、未払い金額を含むすべての損害、費用、および経費を返金および賠償することに同意します。
                </p>
                <p>
                    7.2
                    プレイヤー口座が開設された場合、以下の損害において、お客様は当社および当社の役員等関係者に対して完全な賠償を行い、保護、保持、弁護することに同意します。
                </p>
                <ul className="list-unstyled">
                    <li>
                        (1) ウェブサイトやオンラインカジノへの参加、利用、再利用
                    </li>
                    <li>
                        (2)
                        本利用規約の条件、及び条項に対する違反によって生じる全ての損失、損害、費用、責任
                    </li>
                    <li>
                        (3)
                        本利用規約の不履行や、オンラインカジノ、およびソフトウェア利用から生じる全ての損失、損害、費用、責任
                    </li>
                </ul>
                <p>
                    7.3
                    当社は不正利用や多重登録または当社に対するリスク防止のため、登録後の退会およびアカウントや登録情報の削除対応は行っておらず、退会や削除をご希望の場合には口座の凍結によりそれを行ったものとします。
                </p>
                <p>
                    7.4
                    当社は、引き出し可能な資金を持つ休眠口座の確認を行うために、ユーザーデータベースを年に一度再審査します。
                    お客様のプレイヤー口座が休眠口座とみなされ、12ヶ月以内に連絡が取れない場合、
                    口座内のすべての未払い資金は、当該指示により破棄されます。また、当社は必要であると判断した場合には、お客様のアカウントの凍結、プレイヤー口座残高の没収、および当サービスの終了を行う権利を有します。
                </p>
                <p>
                    7.5
                    お客様のアカウントへの入金はすべて承認済みであり、一度プレイヤー口座へ入金された資金を取り消すことを試みないこと、また第三者への払い戻しを行わないことに同意します。
                </p>
                <p>
                    7.6
                    お客様からの入金はすべて、お客様自身が承認した上で行われたものであり、一度入金された資金を取り消すことはできないものとします。
                </p>
                <p>
                    7.7
                    当社は、妻、夫、友人、親戚を含む第三者からの入金を許可しません。
                    必ずお客様本人名義の口座またはクレジットカードから入金を行う必要があります。
                    第三者による入金が発覚した場合、勝利金額全額を没収し、当社に返却するものとします。ただし、初回の入金額は、当社が指定する方法にて正当な所有者に返金されるものとします。
                </p>
                <p>
                    7.8
                    お客様はチャージバック（お客様側でのクレジット決済の取消）や入金済み資金の取り消し等を行わないことに同意し、チャージバックや入金済み資金の取り消しにより当社が被った損失はすべてお客様に請求されます。
                </p>
                <p>
                    7.9
                    クレジットカードを不正に使用したり、他の詐欺行為（チャージバックや入金済み資金の取り消し等を含む）、
                    マネーロンダリング等の不正資金移動の疑いがある場合、当社はお客様のプレイヤー口座を凍結または閉鎖し、
                    勝利金や既に支払いを終えた資金を徴収する権利があります。その場合、当社は徴収業務を委託する場合があります。
                    そしていかなる場合においても、当社は無許可のクレジットカード（既に盗難届を出されている場合も含む）の使用に対して一切の責任を負いません。
                </p>
                <p>
                    7.10
                    当社で作成したプレイヤー口座に入金された資金は修正されません。
                </p>
                <p>
                    7.11
                    当社は、事前の通知なしにお客様のステータスを上げたり下げたりする権利を保持します。
                </p>
            </div>

            <div className="terms-content__container">
                <p>
                    <strong>第8条 サービスとベットの受付</strong>
                </p>
                <p>
                    8.1
                    ソフトウェアとゲームサーバー間でベット結果に相違が生じた場合、ゲームサーバー上の結果が優先し、当社の記録が最終的な決定権を持ちます。
                </p>
                <p>
                    8.2
                    当社によって認められたアカウントにおいてのみ、ベットが有効です。
                </p>
                <p>
                    8.3
                    ベットは、当社が確認したIPアドレスから行われたものとみなされ、当社のゲーミングサーバーによって認識および記録されたときにのみ受理されます。
                </p>
                <p>
                    8.4
                    技術的問題が発生しベットの送信が完全に行われていない場合、ベットは無効となります。
                </p>
                <p>
                    8.5
                    一度実行されたベットは、変更や削除ができません。ベットの結果に異議がある場合は、受理作業が完了する前に当社に連絡が必要です。当社は独自に調査を行い、最終判断を下します。
                </p>
                <p>
                    8.6
                    お客様が本利用規約や規定を違反し、当社に損害を与える行為が疑われる十分な理由がある場合、当社はお客様のベットを拒否し、サービス利用を停止または終了する権利を有します。
                </p>
                <p>
                    8.7
                    当社は、機器や通信の不具合で発生したベットの実行、受理、記録、通知の不具合に対する責任を負いません。
                </p>
                <p>
                    8.8
                    当社は、いかなる場合でもサービス内容、運営、通信遅れ、自然災害や不測の事態、お客様のアカウントの不正利用等によるすべての損失や被害への責任を負いません。
                </p>
                <p>
                    8.9
                    ベットは、受付期限までに受理されたもののみが有効であり、お客様はこれに同意します。受付期限を過ぎた場合、無効となります。
                </p>
                <p>
                    8.10
                    ベットが置かれる際、オッズやラインが変更されることがあります。当社は、オッズやプライス等の修正・無効・拒否について独自の判断が行えます。8.11
                    各種ゲーミングプロバイダおよびゲームにおけるベット可能額は、予告なく変更されることがあります。
                </p>
                <p>
                    8.12
                    当社は、明らかに誤ったオッズや変更後のオッズ、イベント開始後のベットに対してキャンセルする権利があります。
                </p>
                <p>
                    8.13
                    当社が提供する統計やスコア、ベッティング情報は参考用であり、その誤りに対して当社は責任を負いません。
                </p>
                <p>
                    8.14
                    試合開始が延期・中断された場合、すべてのベットは無効となります。ただし、一部のルールでは例外的に有効となる場合があります。
                </p>
                <p>
                    8.15
                    当社は特定の試合やイベントに特別ルールを採用でき、詳細はオッズ発表と共に記載されます。
                </p>
                <p>
                    8.16
                    当社は試合結果や公式結果に基づいてベット判断を行う権利があります。
                </p>
                <p>
                    8.17 保留中のプレイベットをキャンセルする権利を留保します。
                </p>
                <p>
                    8.18
                    明らかなエラーや誤りがある場合、賭けの一部またはすべてを無効にする権利があります。返金は当社の判断により決定されます。
                </p>
            </div>

            <div className="terms-content__container">
                <p>
                    <strong>第9条 知的財産及び情報</strong>
                </p>
                <p>
                    9.1
                    当社のウェブサイト内において、データ、プログラム、統計、テキスト、グラフィック、ビデオ、オーディオコンテンツ等が含まれる全ての情報は、当社及び当社のライセンス所有者が独占的に所有しております。
                    これには、お客様がウェブサイト上で閲覧することができる当社のデータも含まれます。
                </p>
                <p>
                    9.2
                    お客様は、当社の情報やソフトウェアを複製、保存、修正、コピー、再発行、アップロード、掲載、送信、配布することが禁じられています。また、オンライン上を含む任意の場合においても、
                    第三者や他のウェブサイト、掲示板、その他の機器や手段を用いて当社の情やソフトウェアを販売、貸与、譲渡等の行為を行うことが禁止されています。
                </p>
                <p>
                    9.3
                    当社のサービス、ウェブサイト及びそれらのコンテンツに対する商業的利用や私的利用は禁止されています。
                </p>
                <p>
                    9.4 ブランド名「WIDUS ROYAL
                    CASINO」や当社の他のウェブサイトに関連する商標は、当社および当社のライセンス所有者が独占的に所有しており、お客様にその知的財産権を与えるものではありません。
                </p>
            </div>

            <div className="terms-content__container">
                <p>
                    <strong>第10条 利用条件及びお客様の保証</strong>
                </p>
                <p>
                    10.1
                    お客様は、法律で違法とされている行為や利用規約に違反する行為を行わず、以下の条件に同意し、保証することを前提として、当社のサービスを利用いただきます。
                </p>
                <p>
                    10.2
                    お客様は、21歳以上であるか、またはお客様の居住地の法域においてギャンブルが認められている年齢に達していることを無条件で保証し、健全な判断力をもって、当社が定める利用規約に従い行動するものとします。
                    当社は、未成年者が関与するすべての取引を無効にする権利を有します。
                </p>
                <p>
                    10.3
                    お客様は、「禁止区域」で定義されている国に居住している場合、当社のサービスへのアクセスやアカウント登録を行わないものとします。
                </p>
                <p>
                    10.4
                    お客様は、オンラインカジノが自国で合法であるかを判断し決定する責任があり、適切な審査に基づいてこの判断を行う義務があります。違法である場合、賞金を受け取る権利がなくなり、当社は既に受け取っているすべての賞金を回収や報告する権利を有します。
                </p>
                <p>
                    10.5
                    凍結または使用停止となったプレイヤー口座に関しては、当社が管理権限を保有します。
                </p>
                <p>
                    10.6
                    当社の提供するサービスで資金が失われることがあることを理解し、その責任はお客様にあることを認識していただくものとします。
                </p>
                <p>
                    10.7
                    お客様から提供された個人情報が真実であることに同意し、身元証明の提出や調査が行われる権利を当社に認め、情報変更時には都度連絡することに同意します。
                </p>
                <p>
                    10.8
                    お客様がプレイヤー口座へ入金する資金は、犯罪や不正行為に由来しないものであり、資金洗浄等の法定行為やその意図を持っていないことを表明します。
                </p>
                <p>
                    10.9
                    他人や第三者（未成年を含む）に、当社のサービス利用やアカウント使用、賞金受け取りを許可しないことに同意します。
                </p>
                <p>
                    10.10
                    他のプレイヤーと共謀や不正行為を企てる意向のないことを保証します。
                </p>
                <p>
                    10.11
                    当社のサービス及び利用規約違反により生じた損失や損害、責任から当社を免責します。
                </p>
                <p>
                    10.12
                    お客様は、当社の管理者や役員、取締役等の関係者ではないことを確認します。
                </p>
                <p>
                    10.13
                    当社や関連機関への損失や損害をもたらす行為、またはその可能性がある行為を行わないことを保証します。
                </p>
            </div>

            <div className="terms-content__container">
                <p>
                    <strong>第11条 プライバシー</strong>
                </p>
                <p>
                    11.1
                    個人情報は、お客様に関する様々な情報およびお客様が提供するすべての情報を含むものです。当社は、データ保護および個人情報保護に努めるものとします。
                </p>
                <p>
                    11.2
                    当社は、お客様の個人情報を本サービスに関連する目的のために利用し、また必要に応じてお客様に追加情報の提供を求めることができます。
                </p>
                <p>
                    11.3
                    法律に従い、違法行為や犯罪行為の調査目的で組織や当局から情報が要求された場合、当社は法律や国家および関連組織の要求に従って特定の詳細情報を関連当局に開示する権利があります。
                </p>
                <p>
                    11.4
                    当社は、個人保護法に基づき、第三者にお客様の個人情報を開示することができます。また、当社が必要と判断した場合、
                    お客様の個人情報が当社と提携している金融機関に提供されることがあります。提供された個人情報は、支払い手続きのために該当金融機関によってのみ利用されます。
                </p>
                <p>
                    11.5
                    お客様がインターネットにアクセスする際、ブラウザやクライアントソフトウェアが訪問先ウェブサイトのホストサーバーに情報を送信することがあります。この情報はマーケティングやサービスの向上を目的とし、ウェブサイトの訪問者に関する統計情報の作成に利用されます。
                </p>
            </div>

            <div className="terms-content__container">
                <p>
                    <strong>第12条 ソフトウェアライセンス </strong>
                </p>
                <p>
                    12.1
                    当社は、以下の条項に従い、オンラインカジノを利用するためのソフトウェア使用の個人的で非独占的、および譲渡不可能な権利を認めるものとします。
                </p>
                <p>
                    12.2
                    お客様は以下の行為を行う許諾を受けておらず、当社は本利用規約で明示的に付与されていないすべての権利を有します。
                </p>
                <ul className="list-unstyled">
                    <li>
                        (1)
                        ソフトウェアの複製、改変、転載、またはその組成部分の使用、複製、修正、およびそれらに基づく派生作品の作成や配布。
                    </li>
                    <li>
                        (2)
                        ソフトウェアの二次ライセンス、譲渡、賃貸、貸し出し、ローン、移転、および複製（本利用規約に明確に定められている場合を除く）。
                    </li>
                    <li>
                        (3)
                        ソフトウェアの翻訳、リバースエンジニアリング、編集、分解、修正、それに基づく派生機器の作成や修正。
                    </li>
                    <li>
                        (4) その他のソフトウェアをインストールや起動すること。
                    </li>
                    <li>
                        (5)
                        第三者に対してソフトウェアの全てまたは一部の利用を可能とすること。これには掲示板、オンラインサービス、リモートダイアルイン、ネットワークまたは他の手段が含まれます。
                    </li>
                    <li>
                        (6)
                        オンライン上または電子フォーマットで提供されたユーザー書類の複製や翻訳、またそれに準ずる行為。
                    </li>
                    <li>
                        (7) ソフトウェアのソースコードの全体または一部の開示。
                    </li>
                    <li>
                        (8)
                        当社のセキュリティシステムへの侵入、侵入しようとする試み、アクセスや迂回、またそれらの試み。
                    </li>
                    <li>
                        (9)
                        オンラインカジノおよびウェブサイトの妨害。また、ロボットやそれに類する機器の使用を含むがそれに限定されません。
                    </li>
                    <li>
                        (10)
                        ソフトウェアや関連コンポーネントについての改変、またはそれらの試み。
                    </li>
                </ul>
                <p>
                    12.3
                    本利用規約は、ソフトウェア利用に対するライセンス認可のみに適用されます。ソフトウェアはお客様の所有物ではなく、ソフトウェアは第三者のソフトウェアプロバイダー会社（以下、「第三者ソフトウェアプロバイダー会社」）およびライセンス保有者の独占的な財産です。
                    当社に使用が許諾されているソフトウェアおよびそれに付随する書類はソフトウェアプロバイダーの著作権表示が付された製品であり、その著作権は世界中の著作権保護法により保護されています。
                    お客様によるソフトウェアの使用は、その知的財産の所有権をお客様に与えるものではありません。
                </p>
                <p>
                    12.4
                    当社は、ソフトウェアが著作権侵害をしない、ソフトウェアの動作がエラーを起こさないまたは中断されない、ソフトウェアのあらゆる欠陥が修正される、
                    およびソフトウェアまたはサーバーにウイルスが存在しないことを保証するものではありません。また、プレイヤー口座の決済およびソフトウェアのその他の機能、コンポーネントに関連して通信またはシステムエラーが発生する場合、
                    当社およびソフトウェアプロバイダーはお客様や第三者に対してその問題に起因するコスト、経費、損失または請求について、
                    いかなる責任も負わないものとします。当社は、エラーが発生した場合には関連するゲームをソフトウェアおよびウェブサイトから削除し、その修正に向けて必要な措置を講じる権利を有しています。
                </p>
                <p>
                    12.5
                    お客様は本利用規約において、お客様によるソフトウェアの使用方法が当社の管理下にはないことに同意するものとします。
                    お客様は自己責任でソフトウェアをダウンロードおよびインストールを行い利用し、
                    当社はいかなる種類の直接的損害、間接的損害、付随的損害または特別損害もしくは損失についてもお客様に対して責任を負わないものとします。ただし、当社の過失または怠慢による人身傷害または死亡を除きます。
                </p>
                <p>
                    12.6
                    ソフトウェアにはソフトウェアプロバイダおよび当社にとって機密かつ価値のある情報が含まれています。お客様は本利用規約の条件に従う場合を除いて、その機密情報を利用または開示する権利を有しません。
                </p>
            </div>

            <div className="terms-content__container">
                <p>
                    <strong>第13条 安全性について </strong>
                </p>
                <p>
                    13.1
                    当社は、お客様の安全性を確保するために、アクセスの際には安全なネットワークを通し、暗号化された情報を入力することでアクセスを許可しています。当社が認めていない手段によるアクセスでは、オンラインカジノのゲームを利用できません。
                </p>
                <p>
                    13.2
                    お客様はオンラインカジノを利用することは個人の目的としてのみに限られ、それ以外の商業目的や営利目的および他社の代理としての利用は禁止とします。
                </p>
                <p>
                    13.3
                    当社は、正確なユーザーネームおよびパスワードを入力し認識された人物は全てお客様自身とみなし、それによるサービスの利用は全て有効なものとなります。
                    お客様は自身のユーザーネームおよびパスワードの入力により使用されたあらゆる取引に対し全ての責任を負います。安全性を確保するため、お客様は自身のユーザーネームおよびパスワードを機密にし、他人へ知られないようにしてください。
                </p>
                <p>
                    13.4
                    お客様は、他者のプレイヤー口座や決済手段をオンラインカジノ、ウェブサイト、ソフトウェアへのアクセスのために使用することはできません。また、お客様はいかなる第三者に対しても、オンラインカジノ利用目的で、お客様のプレイヤー口座の使用を許可することはできません。
                </p>
                <p>
                    13.5
                    お客様は、いかなる第三者に対してもオンラインカジノ利用の目的でお客様のプレイヤー口座の使用を許可してはなりません。またお客様は、他人のプレイヤー口座や決済手段、オンラインカジノ、ウェブサイト、ソフトウェアへのアクセスのために使用してはなりません。
                </p>
                <p>
                    13.6
                    当社はお客様が使用するユーザーネームやパスワード、および全ての情報を第三者から保護するよう当社で利用可能な最善の暗号化技術を採用しています。
                    当社によりセキュリティ、及びソフトウェアへ不正なアクセスであると判断された場合、当社はお客様のオンラインカジノへのアクセスの終了、及びプレイヤー口座の凍結、当該局に報告することを独自の裁量で行う権利を有します。
                </p>
            </div>

            <div className="terms-content__container">
                <p>
                    <strong>第14条 変更について</strong>
                </p>
                <p>
                    14.1 当社は、
                    本利用規約、ルール、またはその一部を修正、更新、および改定を単独自由裁量によっていつでも変更することができる権利を有します。
                </p>
                <p>
                    14.2
                    お客様が当ウェブサイトやオンラインカジノの利用を続ける場合、変更後の本利用規約、ルール、またはその一部を当社が通知したか否か、読んだか否かに関わらず、変更に同意することになります。
                </p>
                <p>
                    14.3
                    利用規約の修正、更新、および改定についての確認は、お客様の責任で行うこととします。
                </p>
            </div>

            <div className="terms-content__container">
                <p>
                    <strong>第15条 当社が有する権利について</strong>
                </p>
                <p>
                    15.1
                    当社は、以下の権利を自らの判断で行使することができます。
                </p>
                <ul className="list-unstyled">
                    <li>
                        (1)
                        当ウェブサイトまたはオンラインカジノへの登録申請を拒否する権利
                    </li>
                    <li>
                        (2)
                        当サービス全体または一部へのアクセスを制限・拒否する権利
                    </li>
                    <li>
                        (3)
                        オンラインカジノにおけるゲームや関連サービスを変更、中断、廃止、または追加する権利
                    </li>
                    <li>(4) ベットや賭けに関する制限・拒否する権利</li>
                    <li>
                        (5)
                        お客様が提出した信用情報を含む情報について調査する権利
                    </li>
                </ul>
                <p>
                    15.2
                    賭けや賞金に関する争議が発生した場合、当社が下す決定は最終的で拘束力を持つものとなります。
                </p>
                <p>
                    15.3
                    当社は、賞金の支払いを適切に行うため、お客様のアカウントが調査中である場合その調査が完了し当社が了承するまで全ての支払い及び賞金を保留する権利を有します。また、当社は追加の検証手続きを実施し、追加の証明書等の要求を自らの判断で行うことができます。
                </p>
                <p>
                    15.4
                    当社は、個人情報保護法の範囲内で第三者に対してお客様の個人情報を開示することができます。
                </p>
                <p>
                    15.5
                    当社がお客様に不正行為や詐欺行為などの疑いがあると判断した場合、全ての賞金および支払いの差し止め、また状況に応じて当社が支払うべき資金を全てを合法的に回収する権利を有します。
                    また、ライブゲームのプレイにおいて不審な行動がある場合、当社はお客様の口座残高を超える全ての引き出しを差し控える権利があります。
                </p>
                <p>
                    15.6
                    当社がお客様が不当に利益を得ようとしていると判断した場合、どのようなプレイであってもお客様の全ての資産を差し押さえる権利があります。また、そのような行為がいつ行われたかに関わらず、当社は損害賠償請求の権利を有します。
                </p>
                <p>
                    15.7
                    当社は自らの判断により、期間限定のキャンペーン、ボーナス、またはその他特別オファーを提供・宣伝する権利を有します。これらは特定の利用規約および条件に基づいて行われます。
                    当社は、これらのキャンペーンやボーナス、特別オファーに関連する特定の利用規約および条件を不正使用しようとする場合、全ての支払いおよび賞金を差し止めたり、減額させたり、取り消す権利を有します。
                </p>
                <p>
                    15.8
                    当社はいつでも事前通知なしに、当サービスの運営に必要なライセンス、権利、利用規約等を第三者に譲渡する権利を有します。その際、お客様は譲渡に関わらず一切の同意をするものとします。
                </p>
                <p>
                    15.9
                    当社は法律で認められる範囲で、お客様の名前を広告目的として使用する権利を有します。
                </p>
                <p>第16条 法的な要求事項</p>
                <p>
                    16.1
                    お客様はオンラインカジノやウェブサイトにアクセスしている国、もしくはお客様の居住国の法律で定められている年齢に達している場合にのみ、オンラインカジノ及びウェブサイトを利用することができます。
                </p>
                <p>
                    16.2 いかなる状況であっても、
                    21歳未満の場合オンラインカジノやウェブサイトの利用はできません。
                </p>
                <p>
                    16.3
                    司法管轄区により、オンラインギャンブルが合法である場合と違法区域と定められている場合、もしくは明確に定められていない場合があります。
                    違法区域で当方のサービス利用が可能であり、また当方からオンラインカジノの利用案内があった場合でも、オンラインカジノのプレイは禁止であり、決して利用の許可を意味するものではありません。
                </p>
                <p>
                    16.4
                    オンラインカジノの利用は、該当法により禁止される区域では無効となります。
                </p>
                <p>
                    16.5
                    お客様には、その居住国においてオンラインカジノが合法かどうかを判断、および決定する単独の責任があります。
                </p>
                <p>
                    16.6
                    お客様には、お客様の国においての該当審理に基づき、この判断および決定を行う義務があります。
                </p>
                <p>
                    16.7
                    オンラインカジノの利用が違法である場合、お客様は賞金を受け取る権利はありません。
                    当方はお客様やお客様の代理となる者がすでに受け取っているすべての勝ち金を回収する権利とお客様を関連当局に報告する権利を有します。
                </p>
                <p>
                    16.8
                    オンラインカジノの違法区域の国に居住する場合、上記規定に関わらずオンラインカジノのプレイは禁止となります。
                    この利用規約も正しい日本語にして！利用規約に相応しく！
                </p>
            </div>

            <div className="terms-content__container">
                <p>
                    <strong>第16条 法的要件</strong>
                </p>
                <p>
                    16.1
                    お客様は、オンラインカジノおよびウェブサイトにアクセスしている国、またはお客様の居住国の法律で定められている年齢に達している場合にのみ、オンラインカジノおよびウェブサイトを利用できます。
                </p>
                <p>
                    16.2
                    何らかの状況においても、21歳未満の場合にはオンラインカジノおよびウェブサイトの利用はできません。
                </p>
                <p>
                    16.3
                    司法管轄区によっては、オンラインギャンブルが合法である場合や違法とされる場合、または明確に定められていない場合があります。
                    違法な区域で当社のサービスを利用できる場合や当社からのオンラインカジノ利用案内があった場合でも、オンラインカジノのプレイは禁止であり、決して利用の許可を意味するものではありません。
                </p>
                <p>
                    16.4
                    オンラインカジノの利用は、該当法で禁止される区域では無効です。
                </p>
                <p>
                    16.5
                    お客様には、お客様の居住国でオンラインカジノが合法かどうかを判断し、および決定する単独の責任があります。
                </p>
                <p>
                    16.6
                    お客様には、お客様の国での該当審査に基づき、この判断および決定を行う義務があります。
                </p>
                <p>
                    16.7
                    オンラインカジノの利用が違法である場合、お客様は賞金を受け取る権利がありません。当社はお客様およびその代理人がすでに受け取ったすべての勝ち金を回収する権利と、お客様を関連当局に報告する権利を有します。
                </p>
                <p>
                    16.8
                    違法な区域においてオンラインカジノおよびウェブサイトの利用を禁止することができる国においては、前述の規定に関わらず、オンラインカジノおよびウェブサイトのプレイは禁止されます。
                </p>
            </div>

            <div className="terms-content__container">
                <p>
                    <strong>
                        第17条
                        本利用規約の違反、マネーロンダリング、その他禁止行為について
                    </strong>
                </p>
                <p>
                    17.1
                    当社は、お客様が本利用規約を違反した場合、法律の範囲内であらゆる適切な手段を執行する権利を有します。
                </p>
                <p>
                    17.2
                    お客様の当社に対する取引が詐欺行為や不正行為、あるいはマネーロンダリングの疑いがある場合、当社の判断により、アカウントの凍結、ベットの無効化、資金の没収を行うことがあります。
                </p>
                <p>
                    17.3
                    お客様による当サービスの利用が当該管轄区の法律を違反していた場合、お客様が当社に対する、または当社がお客様に対するあらゆる支払は、
                    当社によって没収または凍結されることを承認するものとします。適用される法律が許す範囲で、当社はすべての支払や調査機関の要求に従い、お客様に関する書類や情報を提出することに関して、一切の責任を負いません。
                </p>
                <p>
                    17.4
                    本利用規約の違反やその他の禁止行為を行った場合、お客様はすべての賞金についての権利を喪失することになります。
                </p>
                <p>
                    17.5
                    当社は、お客様が本利用規約の違反を行っている、または正当な理由があって疑われる場合、当社が利用できる救済措置に加えて、お客様のいかなるベットも拒否し、お客様の賞金や損害等の支払いを停止し、当サービスの利用を停止または終了する権利を有することに同意します。
                </p>
                <p>
                    17.6
                    すべてのベットは、ユーザーのインターフェイスを通じて行われます。複数のブラウザを用いた利用、ソフトウェアに関する情報の操作、確認の試み、その他共謀への関与があった場合、お客様はすべての資金を失いプレイヤーとしての利用ができなくなることになります。
                </p>
                <p>
                    17.7
                    お客様の当カジノ利用における行為や言動が威力業務妨害に当たると当社が判断した場合、口座資金の凍結およびすべてのサービス提供を停止する権利を有します。当社が下す判断は、最終的かつ拘束力を持つものとなります。
                </p>
            </div>

            <div className="terms-content__container">
                <p>
                    <strong>第18条 準拠法</strong>
                </p>
                <p>
                    18.1
                    本利用規約の構成、有効性および執行はカナダ法に準拠します。ただし、これは、差し止め命令やそれに類似する救済のために、当社が司法管轄区裁判所に訴訟を提起することを妨げるものではありません。
                </p>
                <p>
                    18.2
                    本利用規約の一部における違法性、無効性、または法的要件は、その他の部分の合法性、有効性および法的強制力に影響を与えません。
                </p>
            </div>

            <div className="terms-content__container">
                <p>
                    <strong>第19条 オンラインカジノからの自己除外</strong>
                </p>
                <p>
                    お客様は、当社のサポートセンターに依頼を提出することにより、自己除外（自身のプレイヤー口座の制限、凍結）を可能としています。
                    自己除外を行いたい場合は、口座番号と連絡先情報の記載および身分証を提出の上、finance@widusroyal.com宛てにご連絡ください。当社が依頼を受諾した後、お客様に依頼が実行されたことを連絡します。
                </p>
            </div>
        </div>
    </div>
);

export default TermsOfService;
